app/controllers/api/v1/products_controller.rb

  def index
    render json: {
      data: Product.all.order(updated_at: :desc).map{
---
SELECT "products".* FROM "products" ORDER BY "products"."updated_at" ASC, "desc" ASC

  def create
    product = Product.create(product_params)
---
INSERT INTO "products" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "hello"], ["description", nil], ["created_at", "2023-08-16 20:10:31.334904"], ["updated_at", "2023-08-16 20:10:31.334904"]]

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["name", "hello 3"], ["description", "hello 3 description"], ["updated_at", "2023-08-16 20:18:50.133595"], ["id", 3]]

  def destroy
    if @product.destroy
---
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 3]]

  def set_product
    @product = Product.find_by(id: params[:id])

    render json: {
      error: 'product not found'
    }, status: :not_found unless @product.present?
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "products".* FROM "products"